<template>
    <div class="text-left flex flex-col gap-[20px] pt-[20px] mb-[20px]">
      <InfoShortBlock
        :title="bonus1.title"
        :content="bonus1.content"
      />
      <span class="line-bottom"></span>
    </div>
  </template>
  
  <script setup>
  import { ref } from "vue";
  import InfoShortBlock from "../layout/InfoShortBlock.vue";

  const bonus1 = ref({
    title: "Заключение ",
    content: `Завершая наш всесторонний обзор 1xBet Online Casino, мы выступаем в качестве свидетельства захватывающей и безопасной игровой среды, которую мы создали. Охватывая как традиционные, так и инновационные игровые методы, от игр с живым дилером до виртуального спорта, и включая широкий спектр платежных опций, включая передовые криптовалюты, мы удовлетворяем потребности каждого игрока. Наше мобильное приложение гарантирует, что захватывающий мир казино 1xBet будет легкодоступен, обеспечивая бесперебойный игровой процесс в любое время и в любом месте. Для новичков, опытных игроков и всех, кто находится между ними, 1xBet предлагает непревзойденный опыт казино, подчеркнутый нашей приверженностью безопасности, разнообразию и удовлетворенности пользователей. Мы приглашаем вас присоединиться к нашему сообществу и открыть для себя исключительное игровое путешествие, которое ждет вас в 1xBet Online Casino, где каждая игра — это новое приключение.    `,
  });

  </script>
  
  <style lang="scss" scoped></style>
  