<template>
    <div class="text-left">
      <InfoShortBlock
        :content="bonus1.content"
      />
      <span class="line-bottom"></span>
    </div>
  </template>
  
  <script setup>
  import { ref } from "vue";
  import InfoShortBlock from "../layout/InfoShortBlock.vue";

  const bonus1 = ref({
    content: `В 1xBet Online Casino в Японии мы гордимся тем, что предлагаем непревзойденный набор слотов, живых и виртуальных игр как энтузиастам, так и новичкам. Благодаря стремлению к совершенству наша платформа является местом назначения для игроков, ищущих острых ощущений от азартных игр в безопасной, динамичной среде. Наш обзор направлен на то, чтобы раскрыть бесчисленные грани предложений онлайн-казино 1xBet, от адреналиновых слотов до захватывающих впечатлений от живого казино и инновационных виртуальных игр. Обеспечивая бесперебойное и увлекательное игровое путешествие, мы обслуживаем широкий спектр предпочтений, укрепляя наши позиции в динамичном мире онлайн-игр.`,
  });

  </script>
  
  <style lang="scss" scoped></style>
  