<template>
  <div class="pt-[22px] pb-[40px] rounded-[10px] text-left">
    <InfoShortBlock
      :title="regData.title"
      :image="regData.image"
      :content="regData.content"
    />
  </div>
</template>

<script setup>
import { ref } from "vue";
import InfoShortBlock from "../layout/InfoShortBlock.vue";
import regImg from "../../assets/img/reg-1.jpg";

const regData = ref({
  title: "СТАВКА В ОДИН КЛИК",
  content: `Чтобы начать свое приключение в 1xBet Online Casino, нужно сделать всего несколько простых шагов. Сначала посетите наш веб-сайт и найдите кнопку «Регистрация», которая находится на видном месте на главной странице. Нажатие на нее открывает простую форму; выбор опции «Ставка в один клик» ускоряет процесс регистрации, позволяя вам практически сразу же окунуться в игру. Выбрав эту опцию, укажите необходимую информацию, например, страну и предпочитаемую валюту, чтобы с самого начала настроить свой игровой опыт.

  После быстрой регистрации вам нужно будет внести средства на свой счет. Мы предлагаем различные способы оплаты, чтобы сделать этот шаг максимально простым. Пополнив счет, вы готовы исследовать огромный выбор игр в онлайн-казино 1xBet. Независимо от того, привлекает ли вас мигающий свет слотов, стратегическая глубина настольных игр или захватывающий опыт предложений казино в реальном времени, ваше путешествие в мир онлайн-игр начинается всего с нескольких щелчков мыши.
`,
  image: regImg, 
});
</script>

<style lang="scss" scoped></style>
