<template>
  <div class="flex flex-col gap-[20px] text-left">
    <InfoShortBlock
      :title="infoData.title"
      :image="infoData.image"
      :content="infoData.content"
      :contentNext="infoData.contentNext"
    />
  </div>
  <span class="line-bottom"></span>
</template>

<script setup>
import { ref } from "vue";
import InfoShortBlock from "../layout/InfoShortBlock.vue";
import bingoImg from "../../assets/img/desk/tournament.png";

const infoData = ref({
  title: "Турниры казино на 1xBet",
  content: `В 1xBet мы поднимаем азарт казино-игр на новый уровень с нашими захватывающими турнирами казино. Эти соревнования предлагают игрокам уникальный способ играть в любимые игры, соревноваться друг с другом и выигрывать фантастические призы. Наши турниры охватывают широкий спектр игр, от слотов до настольных игр, гарантируя, что найдется что-то для каждого типа игроков.

Участвовать в турнире на 1xBet просто. Как только вы присоединитесь, вы будете соревноваться, играя в определенные игры, накапливая очки на основе ваших побед. Чем больше вы выигрываете, тем выше вы поднимаетесь в таблице лидеров. Лучшие игроки в конце периода турнира получают свою долю призового фонда, который может включать денежные вознаграждения, бесплатные вращения и многое другое.
`,
  contentNext: `Наши турниры рассчитаны на игроков всех уровней, от новичков до опытных ветеранов, предоставляя равные условия, где победители определяются мастерством и удачей. Благодаря регулярно обновляемым темам и призам каждый турнир приносит новые вызовы и возможности для славы.

Присоединяйтесь к нам на 1xBet, чтобы ощутить дух соревнования наших турниров казино. Речь идет не только о играх, в которые вы играете, но и о сражениях, в которых вы побеждаете.
`,
  image: bingoImg,
});
</script>

<style lang="scss" scoped></style>
