<template>
  <div class="text-left flex flex-col gap-[20px] pb-[20px]">
    <InfoShortBlock
      :title="infoData.title"
      :image="infoData.image"
      :content="infoData.content"
    />

    <span class="line-bottom"></span>
    <InfoShortBlock
      :title="infoData2.title"
      :image="infoData2.image"
      :content="infoData2.content"
    />
    <span class="line-bottom"></span>
    <InfoShortBlock
      :title="infoData3.title"
      :image="infoData3.image"
      :content="infoData3.content"
    />
  </div>
  <span class="line-bottom"></span>

</template>

<script setup>
import { ref } from "vue";
import InfoShortBlock from "../layout/InfoShortBlock.vue";
import image from "../../assets/img/inst-n/1.png";
import image2 from "../../assets/img/inst-n/2.png";
import image3 from "../../assets/img/inst-n/3.png";

const infoData = ref({
  title: "Мгновенные ставки в 1xbet    ",
  content: `В 1xBet мы всегда стремимся усилить азарт игры с помощью инновационных вариантов ставок. Вот почему наши игры с мгновенными ставками стали основным продуктом для тех, кто ищет быстрые действия и немедленные результаты. Среди них Aviator и JetX выделяются своим уникальным игровым процессом и захватывающим опытом. Давайте углубимся в то, что делает эти игры обязательными для пробы в 1xBet Online Casino.    `,
  image: image,
});
const infoData2 = ref({
  title: "Авиатор    ",
  content: `Aviator — это новое поколение игр со ставками, сочетающее простоту с высоким выбросом адреналина. Игроки делают ставки на результат увеличивающейся кривой, которая может рухнуть в любой момент. Чем дольше вы ждете перед обналичиванием, тем выше потенциальный выигрыш. Но будьте осторожны, ждите слишком долго, и вы можете потерять все, если кривая рухнет. Это игра нервов, стратегии и времени. Социальный аспект Aviator позволяет вам видеть ставки и обналичивания других игроков в режиме реального времени, добавляя игре дополнительный уровень азарта.    `,
  image: image2,
});
const infoData3 = ref({
  title: "ДжетИкс",
  content: `JetX — еще одно захватывающее дополнение к нашему портфолио игр с мгновенными ставками. Игроки делают ставки на реактивный самолет, когда он взлетает, а потенциальный выигрыш увеличивается по мере того, как самолет набирает высоту. В чем подвох? Самолет может взорваться в любой момент, и время имеет решающее значение, чтобы обналичить деньги до того, как это произойдет. Привлекательность JetX заключается в его простом, но захватывающем игровом процессе, что делает его идеальным для игроков, ищущих немедленных острых ощущений от ставок с потенциалом значительной отдачи от своих ставок.
  
В 1xBet наши мгновенные игры ставок, такие как Aviator и JetX, предлагают быстрый и увлекательный способ насладиться азартом ставок. Эти игры идеально подходят для моментов, когда вы ищете мгновенного удовлетворения или просто короткого перерыва с шансом выиграть по-крупному. Исследуйте вместе с нами стремительный мир мгновенных игр ставок и узнайте, почему они стали фаворитами среди наших игроков.
`,
  image: image3,
});
</script>

<style lang="scss" scoped></style>
