<template>
    <div class="flex flex-col gap-[20px] text-left">
      <InfoShortBlock
        :title="infoData.title"
        :image="infoData.image"
        :content="infoData.content"
      />
    </div>
  </template>
  
  <script setup>
  import { ref } from "vue";
  import InfoShortBlock from "../layout/InfoShortBlock.vue"
  import bingoImg from "../../assets/img/main-n/resp.png";

  
  const infoData = ref({
    title: "1xBet Ответственная игра    ",    
    content: `
1xBet мы ценим благополучие наших игроков превыше всего, поэтому ответственная игра является краеугольным камнем нашей платформы. Мы понимаем важность поддержания сбалансированного подхода к азартным играм и предоставляем различные инструменты и ресурсы для поддержки наших пользователей в этом. Наша приверженность ответственной игре непоколебима, и мы принимаем меры для предотвращения участия несовершеннолетних в азартных играх и оказания помощи тем, кому может потребоваться помощь в управлении своими игровыми привычками.

Мы призываем игроков устанавливать лимиты на депозиты, потери и время сеанса, чтобы способствовать созданию здоровой игровой среды. Кроме того, наша команда поддержки клиентов обучена распознавать признаки проблемного поведения в азартных играх и предлагать рекомендации и поддержку пострадавшим пользователям. Мы также предоставляем ссылки на профессиональные организации помощи тем, кто ищет дополнительную поддержку.

Ответственная игра в 1xBet заключается в том, чтобы обеспечить нашим игрокам доступ к приятному, честному и безопасному игровому опыту, полностью осознавая потенциальные риски. Мы стремимся поддерживать эти принципы и способствовать созданию игровой среды, которая ставит благополучие наших игроков на первое место.
`,
    image: bingoImg, 
  });

  
  </script>
  
  <style lang="scss" scoped></style>
  