//Dep.vue
<template>
  <div class="flex flex-col gap-[20px] rounded-[10px] text-left">    
    <InfoListBlock
      :title="infoData.title" 
      :content="infoData.content" 
      :listItems="infoData.listItems"
      :listDescription="infoData.listDescription"
    />
  </div>
</template>

<script setup>
import { ref } from "vue";
import InfoListBlock from "../layout/InfoListWithTip.vue"; 


const infoData = ref({
  title: "Советы и стратегии в казино 1xBet",
  content: `В 1xBet Casino мы считаем, что хорошо информированный игрок — успешный игрок. Вот почему мы стремимся предоставить нашим игрокам стратегии и советы, которые могут значительно улучшить их игровой опыт и потенциально увеличить их шансы на победу. Вот три прибыльные стратегии для игры в нашем онлайн-казино:`,
  listItems: [
    "Управление банкроллом: Одной из ключевых стратегий успешной игры в онлайн-казино является эффективное управление банкроллом. Выделите определенную сумму для своей игровой сессии и придерживайтесь ее. Это помогает минимизировать потери и гарантировать, что вы играете в рамках своих лимитов.",
    "Понимание игровой механики: прежде чем погрузиться в любую игру, не торопитесь, чтобы понять ее правила и механику. Игра в знакомые вам игры увеличивает ваши шансы на победу. Используйте наши бесплатные версии, чтобы понять игру, не рискуя своим банкроллом.",
    "Используйте бонусы с умом: 1xBet Casino предлагает множество бонусов и акций, призванных продлить ваш игровой процесс и повысить ваш выигрышный потенциал. Воспользуйтесь этими предложениями, но обязательно ознакомьтесь с условиями. Использование бонусов с умом может дать вам дополнительное игровое время и больше шансов на победу.",
  ],
    listDescription:`Внедрение этих стратегий в ваш игровой процесс может не только улучшить ваш общий опыт в 1xBet Casino, но и повысить ваши шансы на получение прибыльных доходов. Помните, азартные игры всегда должны быть интересными, поэтому играйте ответственно    `,
});
</script>



<style lang="scss" scoped>

</style>