//Dep.vue
<template>
  <div class="flex flex-col gap-[20px] rounded-[10px] text-left">    
    <InfoListBlock
      :title="infoData.title" 
      :content="infoData.content" 
      :listItems="infoData.listItems"
      :image="infoData.image"
      :imageDestop="infoData.imageDestop"
      :listDescription="infoData.listDescription"
    />
  </div>
  <span class="line-bottom"></span>

</template>

<script setup>
import { ref } from "vue";
import InfoListBlock from "../layout/InfoListBlock.vue"; 
import image from "../../assets/img/main-n/virtual-cas.png";
import imageDestop from "../../assets/img/desk/uniq-cas.png";


const infoData = ref({
  title: "1xbet Уникальные игры казино",
  content: `В 1xBet мы гордимся тем, что предлагаем эксклюзивный игровой опыт, который отличает нас от конкурентов. Наши уникальные игры казино специально созданы, чтобы предоставить нашим игрокам непревзойденный игровой азарт и возможность насладиться отличительными темами и механикой. От зачарованных лесов до классических фруктов с изюминкой, наши эксклюзивные игры созданы, чтобы увлекать и развлекать. Давайте рассмотрим некоторые уникальные игры, которые вы можете найти только в 1xBet Online Casino.`,
  listItems: [
    "Lucky Forest Casino: Погрузитесь в волшебный мир Lucky Forest Casino, где мистические существа ведут вас к скрытым богатствам. Этот слот сочетает в себе очаровательные визуальные эффекты с захватывающим игровым процессом, предлагая уникальное приключение и шанс обнаружить секретные сокровища.",
    "1xTwin Fruits: 1xTwin Fruits берет классический фруктовый слот и удваивает веселье. С двумя наборами барабанов в игре возможности выиграть увеличиваются, делая каждое вращение вдвойне захватывающим.",
    "1x Mania: 1x Mania обеспечивает высокоэнергетический слот-экшн с динамичным поворотом. Его яркий дизайн и привлекательные бонусные функции гарантируют захватывающие впечатления с каждой игрой.",
    "1x Hotline: Вдохновленная ретро-боевиками, 1x Hotline предлагает захватывающую сюжетную линию вместе со своими вращающимися барабанами. Эта игра идеально подходит для тех, кто любит дозу ностальгии в своих играх.",
    "Virtual Generation: окунитесь в разнообразные предложения Virtual Generation, включая виртуальный футбол, скачки и собачьи бега, все из которых созданы для того, чтобы предоставить вам непрерывные возможности для ставок.",

  ],
    image: image,
    imageDestop: imageDestop,
    listDescription:`Эти уникальные игры отражают нашу приверженность предоставлению разнообразной и эксклюзивной игровой среды на 1xBet. Присоединяйтесь к нам, чтобы открыть для себя эти и многие другие эксклюзивные названия, которые предлагают не только шанс выиграть, но и незабываемый игровой опыт.`,
});
</script>







<style lang="scss" scoped>

</style>