<template>
    <div class="flex flex-col gap-[20px] text-left">
      <InfoShortBlock
        :title="infoData.title"
        :image="infoData.image"
        :content="infoData.content"
      />
    </div>
  </template>
  
  <script setup>
  import { ref } from "vue";
  import InfoShortBlock from "../layout/InfoShortBlock.vue"
  import image from "../../assets/img/main-n/sufytty.svg"

  
  const infoData = ref({
    title: "Обеспечение безопасности пользователей и честности на 1xBet",
    content: `В 1xBet безопасность и честность наших игроков стоят на первом месте среди наших приоритетов. Мы стремимся создать безопасную среду, в которой наши пользователи могут наслаждаться игрой без опасений. Для этого мы используем самые современные технологии шифрования для защиты личных и финансовых данных. Кроме того, наши игры поставляются надежными поставщиками, гарантируя честную игру с помощью регулярно проверяемых генераторов случайных чисел (ГСЧ). Мы также предлагаем ответственные игровые инструменты и ресурсы, чтобы помочь нашим игрокам сохранить контроль над своей игровой деятельностью. Наша преданная своему делу команда поддержки клиентов всегда готова помочь с любыми вопросами или проблемами, гарантируя безопасный, честный и приятный опыт на 1xBet.`,
    image: image, 
  });

  
  </script>
  
  <style lang="scss" scoped></style>
  