<template>
    <div class="flex flex-col gap-[20px] text-left">
      <InfoShortBlock
        :title="infoData.title"
        :image="infoData.image"
        :content="infoData.content"
      />
    </div>
  </template>
  
  <script setup>
  import { ref } from "vue";
  import InfoShortBlock from "../layout/InfoShortBlock.vue"
  import bingoImg from "../../assets/img/main-n/using.svg";

  
  const infoData = ref({
    title: "Использование криптовалютных платежей для игры на 1xBet",    
    content: `В 1xBet, принимая будущее финансов, мы предлагаем нашим игрокам инновационную возможность использовать криптовалюту как для депозитов, так и для вывода средств. Этот современный подход не только гарантирует быстроту и безопасность транзакций, но также обеспечивает анонимность и снижает комиссии за транзакции. Игроки могут выбирать из обширного списка криптовалют, включая, помимо прочего, Bitcoin, Ethereum, Litecoin и Dogecoin. Каждая криптовалютная опция, например Tether в различных блокчейнах (Tron, Ethereum, BSC) и другие, такие как TRON и XRP, разработана с учетом разнообразных предпочтений наших пользователей. 

С минимальными требованиями к депозиту в размере 1,00 USD или EUR для большинства криптовалют мы делаем это простым и доступным для каждого, чтобы наслаждаться любимыми играми казино. Кроме того, без платы за обслуживание и с мгновенным временем транзакций вы можете начать играть немедленно, без каких-либо хлопот. В 1xBet мы стремимся обеспечить бесперебойный и обогащенный игровой опыт, используя преимущества криптовалютных платежей.`,
    image: bingoImg, 
  });

  
  </script>
  
  <style lang="scss" scoped></style>
  