<template>
  <div class="text-left variety-of-games-wrapper flex flex-col gap-[20px]">
    <InfoShortBlock
      :title="criket.title"
      :image="criket.image"
      :content="criket.content"
    />

    <span class="line-bottom"></span>
    <InfoShortBlock
      :title="football.title"
      :image="football.image"
      :content="football.content"
    />

    <span class="line-bottom"></span>
    <InfoShortBlock :title="hockey.title" :image="hockey.img" :content="hockey.content" />

    <span class="line-bottom"></span>
    <InfoShortBlock
      :title="basketball.title"
      :image="basketball.img"
      :content="basketball.content"
    />
    <span class="line-bottom"></span>
    <InfoShortBlock :title="valley.title" :image="valley.img" :content="valley.content" />
    <span class="line-bottom"></span>
  </div>
</template>

<script setup>
import { ref } from "vue";
import InfoShortBlock from "../layout/InfoShortBlock.vue";

import criketImg from "../../assets/img/games-n/sport1.png";
import footballImg from "../../assets/img/games-n/sport2.png";
import hockeyImg from "../../assets/img/games-n/sport3.png";
import basketballImg from "../../assets/img/games-n/sport5.png";
import valleyImg from "../../assets/img/games-n/sport6.png";

const criket = ref({
  title: "Выбор игр казино 1xBet",
  content: `В 1xBet мы понимаем пульс наших игроков и стремимся предоставить игровой опыт, который одновременно захватывающий и разнообразный. Наш обширный выбор игр подходит для всех типов игроков, будь вы новичок или опытный игрок. От классических настольных игр до динамичных слотов, наши онлайн-игры казино созданы для развлечения и предоставляют широкие возможности для выигрыша. Погрузитесь в сердце азартных игр казино с нашими самыми популярными предложениями.`,
  image: criketImg, // Исправлено на criketImg
});
const football = ref({
  title: "БАККАРА",
  content: `Баккара, игра элегантности и напряжения, занимает почетное место в нашем выборе. Ее простота обманчива, поскольку результаты — Игрок, Банкир и Ничья — предлагают глубокие стратегии ставок. На 1xBet мы предлагаем вам ряд версий Баккара от традиционных до более современных итераций, гарантируя, что как новые игроки, так и опытные игроки найдут свой любимый стиль. Благодаря интуитивно понятным интерфейсам и действию в реальном времени наши столы Баккара обещают игровой опыт мирового класса.`,
  image: footballImg,
});
const hockey = ref({
  title: "ПОКЕР",
  content: `Покер остается краеугольным камнем азартных игр в казино, сочетая мастерство, стратегию и немного удачи. Наша платформа предлагает различные игры в покер, включая Техасский Холдем, Омаху и другие, рассчитанные на разные уровни мастерства и предпочтений. Независимо от того, хотите ли вы присоединиться к обычной игре или принять участие в турнирах с высокими ставками, покерные комнаты 1xBet — это идеальное место для проверки своих навыков против соперников со всего мира.`,
  img: hockeyImg,
});
const basketball = ref({
  title: "БЫСТРОЕ КЕНО",
  content: `Для тех, кто любит быстрый темп и мгновенные результаты, Fast Keno — захватывающий выбор. Эта игра в стиле лотереи заключается в выборе чисел и надежде, что они совпадут с выпавшими. Fast Keno на 1xBet разработана для эффективности и скорости, позволяя проводить быстрые раунды, которые держат вас в напряжении. Это идеальная игра для игроков, ищущих быструю игровую фиксацию с шансом на существенные выплаты.`,
  img: basketballImg,
});
const valley = ref({
  title: "Волейбольные матчи",
  content: `Блэкджек, или 21, — это игра, которая сочетает в себе удачу, мастерство и стратегию в стремлении обыграть дилера. В 1xBet мы предлагаем разнообразные игры в блэкджек, от классических до американских и европейских версий. Каждая игра представляет собой уникальный вызов, будь то взятие карты, остановка, удвоение или разделение. Наши столы для блэкджека рассчитаны на игроков всех уровней, предлагая комплексный игровой опыт, который отражает волнение игры в живом казино.

Выбор игр 1xBet тщательно отбирается, чтобы гарантировать, что все наши игроки найдут игры, которые им нравятся, с разнообразием и качеством, чтобы удерживать их внимание и развлечение. Наша приверженность предоставлению превосходного опыта онлайн-казино очевидна в широте и глубине наших игровых предложений. Присоединяйтесь к нам в 1xBet, где азарт казино всего в одном клике.`,

  img: valleyImg,
});
</script>

<style lang="scss" scoped></style>
