//Dep.vue
<template>
  <div class="flex flex-col gap-[20px] rounded-[10px] text-left">    
    <InfoListBlock
      :title="infoData.title" 
      :content="infoData.content" 
      :listItems="infoData.listItems"
      :image="infoData.image"
      :listDescription="infoData.listDescription"
    />
  </div>
  <span class="line-bottom"></span>

</template>

<script setup>
import { ref } from "vue";
import InfoListBlock from "../layout/InfoListBlock.vue"; 
import image from "../../assets/img/main-n/virtual-cas.png";


const infoData = ref({
  title: "Виртуальное казино и карточные игры 1xBet",
  content: `В 1xBet мы переносим острые ощущения от казино в виртуальную реальность, предлагая широкий спектр виртуальных казино и карточных игр, которые обещают как волнение, так и крупные выигрыши. Наш набор виртуальных игр, созданный ведущими разработчиками, обеспечивает захватывающий и динамичный игровой опыт, позволяя игрокам наслаждаться сутью азартных игр в любое время и в любом месте. Вот краткий обзор некоторых лучших виртуальных игр, доступных в онлайн-казино 1xBet:`,
  listItems: [
    "Golden Race: Погрузитесь в мир виртуального спорта с Golden Race, где вы можете делать ставки на виртуальный футбол, скачки и многое другое. Реалистичная графика и многочисленные варианты ставок делают его лучшим выбором для любителей спорта.",
    "Leap: Leap предлагает широкий выбор виртуальных видов спорта — от собачьих бегов до велоспорта. Все они отличаются высококачественной анимацией и динамичными действиями.",
    "Global Bet: специализируясь на виртуальном спорте, Global Bet предлагает широкий выбор игр, таких как виртуальный футбол, теннис и скачки, гарантируя, что всегда есть что-то новое для ставок.",
    "Kiron Interactive: Kiron Interactive выделяется широким выбором виртуальных видов спорта и гоночных игр, предлагая уникальный опыт ставок посредством реалистичных симуляций.",
    "Virtual Generation: окунитесь в разнообразные предложения Virtual Generation, включая виртуальный футбол, скачки и собачьи бега, все из которых созданы для того, чтобы предоставить вам непрерывные возможности для ставок.",
    "Betradar: компания Betradar, известная своими виртуальными видами спорта, основанными на данных, предлагает все: от виртуального футбола до баскетбола, обеспечивая бесперебойный и увлекательный процесс ставок.",
    "1×2 Virtuals: С 1×2 Virtuals игроки могут наслаждаться различными видами спорта, включая футбол, скачки и автогонки, дополненными простым игровым процессом и четкой графикой.",
    "DS Virtual Gaming: Завершая нашу подборку, DS Virtual Gaming предлагает высококачественные виртуальные гоночные игры и числовые игры, призванные увлекать и развлекать.",
  ],
    image: image,
    listDescription:`В 1xBet наше виртуальное казино и карточные игры — это больше, чем просто ставки; это возможность испытать азарт игры, независимо от того, где вы находитесь. Присоединяйтесь к нам, чтобы открыть для себя бесконечные возможности и удобство виртуальных игр.`,
});
</script>


<style lang="scss" scoped>

</style>