//Dep.vue
<template>
  <div class="flex flex-col gap-[20px] rounded-[10px] text-left">    
    <InfoListBlock
      :title="infoData.title" 
      :content="infoData.content" 
      :listItems="infoData.listItems"
      :image="infoData.image"
      :listDescription="infoData.listDescription"
    />
  </div>
</template>

<script setup>
import { ref } from "vue";
import InfoListBlock from "../layout/InfoListBlock.vue"; 
import image from "../../assets/img/main-n/which-curr.png";


const infoData = ref({
  title: "Какие валюты можно использовать для игры в казино?",
  content: `
В 1xBet Casino мы понимаем важность предоставления нашим игрокам разнообразных валютных вариантов для обеспечения бесперебойного игрового процесса. В дополнение к традиционным фиатным валютам мы гордимся тем, что поддерживаем самые популярные криптовалюты, предлагая нашим игрокам гибкость и конфиденциальность, которые они желают. Криптовалютные транзакции имеют преимущество в том, что они быстрые, безопасные и анонимные, что делает их идеальным выбором для онлайн-игр.
Среди криптовалют, которые мы принимаем:
`,
  listItems: [
    "Биткоин (BTC): первая и самая известная криптовалюта, известная своей безопасностью и широким признанием.",
    "Ethereum (ETH): популярен благодаря быстрому времени транзакций и функциональности смарт-контрактов.",
    "Litecoin (LTC): ценится за быструю обработку и низкие комиссии за транзакции.",
    "Ripple (XRP): известен своей эффективностью и широким использованием в финансовых транзакциях в режиме реального времени.",

  ],
    image: image,
    listDescription:`Эти опции являются частью нашего обязательства по предоставлению удобной и универсальной платформы, которая отвечает потребностям нашей разнообразной базы игроков. В 1xBet Casino внедрение инноваций и технологий является ключом к обеспечению наилучшего игрового опыта для всех наших игроков.`,
});
</script>







<style lang="scss" scoped>

</style>